In [1]:
import pandas as pd
import numpy as np

In [6]:
ser1 = pd.Series(list('abcdefghik'))
ser2 = pd.Series(np.arange(10))

ser1.name='col1'
ser2.name='col2'
pd.concat([ser1,ser2],axis=1)

  col1  col2
0    a     0
1    b     1
2    c     2
3    d     3
4    e     4
5    f     5
6    g     6
7    h     7
8    i     8
9    k     9

In [4]:
pd.DataFrame({'col1':ser1,'col2':ser2})

  col1  col2
0    a     0
1    b     1
2    c     2
3    d     3
4    e     4
5    f     5
6    g     6
7    h     7
8    i     8
9    k     9

In [7]:

data = {'Name':['DDD', 'BBB', 'CCC', 'AAA', 'DDD1', 'BBB1', 'CCC1', 'AAA1' ],
'Age':[47, 24, 22, 32,40, 54, 62, 31 ],
'Salary':[9000,4000,5000,8000,5000,8000,5500,4400],
'Department':['IT', 'HR', 'FINANCE', 'MARKETING','IT', 'HR', 'FINANCE', 'MARKETING']}

df = pd.DataFrame(data)

In [51]:
df1= pd.read_csv('dirtydata.csv')

In [52]:
df_orig = df1.copy()

In [53]:
df1.head(5)

   Duration          Date  Pulse  Maxpulse  Calories
0        60  '2020/12/01'    110       130     409.1
1        60  '2020/12/02'    117       145     479.0
2        60  '2020/12/03'    103       135     340.0
3        45  '2020/12/04'    109       175     282.4
4        45  '2020/12/05'    117       148     406.0

In [54]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  32 non-null     int64
 1   Date      31 non-null     object
 2   Pulse     32 non-null     int64
 3   Maxpulse  32 non-null     int64
 4   Calories  30 non-null     float64
dtypes: float64(1), int64(3), object(1)
memory usage: 1.4+ KB

In [55]:
df1.describe()

         Duration       Pulse    Maxpulse    Calories
count   32.000000   32.000000   32.000000   30.000000
mean    68.437500  103.500000  128.500000  304.680000
std     70.039591    7.832933   12.998759   66.003779
min     30.000000   90.000000  101.000000  195.100000
25%     60.000000  100.000000  120.000000  250.700000
50%     60.000000  102.500000  127.500000  291.200000
75%     60.000000  106.500000  132.250000  343.975000
max    450.000000  130.000000  175.000000  479.000000

In [56]:
df1.shape

(32, 5)

In [57]:
df1.isnull().sum()

Duration    0
Date        1
Pulse       0
Maxpulse    0
Calories    2
dtype: int64

In [58]:
df1.dropna(inplace=True)

In [59]:
df1.shape

(29, 5)

In [60]:
df_orig.shape

(32, 5)

In [61]:
df_orig['Calories'] = df_orig['Calories'].fillna(df_orig.Calories.median())

In [62]:
df_orig.isnull().sum()

Duration    0
Date        1
Pulse       0
Maxpulse    0
Calories    0
dtype: int64

In [63]:
df_orig.head(5)

   Duration          Date  Pulse  Maxpulse  Calories
0        60  '2020/12/01'    110       130     409.1
1        60  '2020/12/02'    117       145     479.0
2        60  '2020/12/03'    103       135     340.0
3        45  '2020/12/04'    109       175     282.4
4        45  '2020/12/05'    117       148     406.0